{"Classification": "Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "100% Single Punch", "jutsu_description": "Tsunade gathers large amounts of chakra in her hand and releases it as she punches the opponent."}
{"Classification": "Ninjutsu, Clone Techniques", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Afterimage Clone", "jutsu_description": "Shisui uses the Body Flicker Technique, and moves around creating several afterimages. With his speed, he can move between his afterimages, and deliver attacks from each of them, each of them having mass behind them. If attacked, he moves out of the way, letting his opponent's attack go through one of his afterimages. He is able to move so fast between the afterimages that not only is each one indistinguishable via Sensor Types, but he can also attack opponents with several afterimages at once. \n\nSee Also[]\nSecret Sword: Moonlight"}
{"Classification": "Kenjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Afterglow", "jutsu_description": "Sasuke dashes toward his opponent and quickly slashes them with his sword."}
{"Classification": "Taijutsu", "Nature": "Lightning Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "10 Hit Combo", "jutsu_description": "Lars punches the opponent before striking them into the air with a lightning-infused uppercut. He would jump above with amazing speed and punch the opponent, then strike a lightning-infused blow down to the stomach."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Air Raid Shot", "jutsu_description": "Kankurō's puppet, Karasu, soars into the air with the help of a special flight modification and releases a series of bombs upon the enemy that explodes on impact. An advanced version is that these bombs can be filled with poisonous gas to cause extra damage."}
{"Classification": "Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "100 Metre Punch", "jutsu_description": "A shorter version of the 1000 Metre Punch, the user concentrates their chakra into their fist and lands a devastating blow on the opponent, sending them flying to at least 100 metres away from where the user is."}
{"Classification": "Taijutsu, Shurikenjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Air Lightning Strike", "jutsu_description": "The user punches the opponent twice with their fist, then palms them upward to launch them high into the air. The user then jumps above them and punches them back down. Then, the user binds the opponent with large shuriken from above, then lands several powerful blows while spinning like a drill, drilling the opponent into the ground. Upon the user hopping off of their target, the victim even ends up spinning along the ground afterwards due to the momentum of the prior spin."}
{"Classification": "Taijutsu, Shurikenjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Air Lightning Bullet", "jutsu_description": "The user punches the opponent twice with their fist, then palms them upward to launch them high into the air. The user then jumps above them and punches them back down. Then, the user binds the opponent with large shuriken from above, then lands on them with a powerful stomp."}
{"Classification": "Kekkei Genkai, Ninjutsu", "Nature": "Magnet Release", "Class": "Defensive", "Range": "Mid to Long range (5m+)", "jutsu_name": "Air Gold Dust Protective Wall", "jutsu_description": "Making use of his Gold Dust, the Fourth Kazekage raises it above him to create a thick barricade in order to block incoming aerial attacks, whilst using hand gestures to dictate the shape that the barrier adopts. This ability is strong enough to guard against even Gaara's Sand Hail technique."}
{"Classification": "Hiden, Ninjutsu, Fūinjutsu, Barrier Ninjutsu, Space–Time Ninjutsu, Cooperation Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Adamantine Sealing Chains: Spiral Formation", "jutsu_description": "Kushina uses her chains to form a barrier while Minato teleports above the opponent and slams them down with a Rasengan."}
{"Classification": "Ninjutsu, Bukijutsu, Cooperation Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Adamantine Technique: Cranium Crusher", "jutsu_description": "Hiruzen jumps up high to reach his opponent, attacks his opponent with a transformed Enma twice, and finishes by enlarging him as landing the final blow on the opponent's head with the end of the staff."}
{"Classification": "Ninjutsu, Fūinjutsu, Cooperation Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Adamantine Seal: Monkey Yang Suppression", "jutsu_description": "After placing fūinjutsu tags in an area, the users create a sealing barrier that takes the form of an ethereal monkey hand that cages the target. The seal requires a substantial amount of chakra to complete, and can quickly tire out the user, allowing the target to escape."}
{"Classification": "Ninjutsu, Clone Techniques, Bukijutsu", "Nature": "", "Class": "Defensive, Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Adamantine Prison Wall", "jutsu_description": "After using Transformation: Adamantine Staff, Enma clones himself to create a lattice box around a target. Because of the toughness of Enma's adamantine form, opponents cannot break through the box once it's formed. When this box is formed around allies, this effectively protects them from harm. When it is formed around opponents, this effectively imprisons them until Enma chooses to release them.[1]"}
{"Classification": "Kekkei Genkai, Ninjutsu, Taijutsu, Fighting Style", "Nature": "Boil Release", "Class": "Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Boil Release: Unrivalled Strength", "jutsu_description": "Boil Release: Unrivalled Strength is a ninjutsu fighting style used by Kokuō and its jinchūriki.\n\nContents\n\n1 Usage\n2 Improvement\n3"}
{"Classification": "Kekkei Genkai, Ninjutsu", "Nature": "Boil Release", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Boil Release: Steam Explosion", "jutsu_description": "The user releases a massive cloud of boiling steam surrounding them, burning whatever or whoever is nearby."}
{"Classification": "Kekkei Genkai, Ninjutsu", "Nature": "Boil Release", "Class": "Offensive, Supplementary", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Boil Release: Skilled Mist Technique", "jutsu_description": "The user creates a cloud of mist which they release from their mouth. This mist is highly acidic in nature, capable of melting bodies, and even chakra-based defences and barriers, nullifying them. Even Sasuke Uchiha's Susanoo was affected, despite being considered an \"absolute defence\".[1] The technique has an inherent disadvantage in that its effects are indiscriminate, limiting its usage to areas that do not contain allies. In the event that the mist escapes the containment area, the user can adjust the pH level of the mist to safer levels.[2]\nThough the mist is corrosive to all around it, the user seems to be immune to it, as Mei used it in an enclosed area without endangering herself.\n\nReferences[]\n\n↑ 1.0 1.1 Fourth Databook, page 292\n\n↑ Naruto chapter 466, page 12"}
{"Classification": "Kekkei Genkai, Ninjutsu", "Nature": "Boil Release", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Boil Release: Flower Repentance Technique", "jutsu_description": "The user manipulates their chakra, creating corrosive vapour that can be released from the ground at various spots. The user can then cause explosions from that vapour in each of these spots."}
{"Classification": "Taijutsu, Ninjutsu", "Nature": "Earth Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Agonizing Thorn Technique (Simply Put a Kanchō)", "jutsu_description": "After punching and kicking the opponent a few times, Tobi performs the Skewering Headbutt, burrowing himself underground, and comes up from below his opponent, performing a kanchō on them."}
{"Classification": "Ninjutsu, General skill", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Body Replacement Technique", "jutsu_description": "This article is about the general skill. For Zetsu's personal technique, see Substitute Technique.\n\n\n\n\nThe instant before they are to be struck by an attack, the user replaces themselves with a block of wood or something similar. Because the attack does hit something, opponents may briefly believe that they've successfully struck the user. But this is merely an optical illusion and opponents will quickly notice what's happened. If users are fast enough, they can use this brief lapse in the opponent's attentions to stage a counterattack;[1] in the anime, the replacement log itself has been shown used as an attack, being applied with explosive tags.[2] Alternatively, this is a good opportunity for users to escape.[1]\nThe Body Replacement Technique can evidently only be used in response to what would be harmful attacks: Pain only escapes from Jiraiya's Wild Lion's Mane Technique when Jiraiya tries to kill him with it; when Jiraiya uses the same technique to only keep Pain restrained, Pain remains captured.[3]"}
{"Classification": "Hiden, Ninjutsu, Fūinjutsu, Barrier Ninjutsu", "Nature": "", "Class": "Offensive, Supplementary", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Adamantine Sealing Chains", "jutsu_description": "This is a sealing technique that is characteristic of the Uzumaki clan.[1] Users produce chains made out of their own chakra, which typically emerge from their torso. Users control the chains as they extend outwards from their body, most commonly to wrap around targets and restrain them.[2] The chains are extremely durable, enough that even the Nine-Tails would struggle to destroy them.[1] In the anime, in addition to physically binding targets, the chains are said to neutralise their target by binding and nullifying their chakra.[3] Depending on the number and the length of chains that users intend to produce, they may prefer to initially create only a few chains, which they send underground to split apart and spread around the area as needed, leaving their immediate surroundings uncluttered.[4]\n\nThe chains creating a barrier.The chains binding the Nine-Tails within Kushina's subconscious.1/2\nA barrier can be erected between two or more sealing chains, which is quite impregnable: Kushina Uzumaki creates such a barrier to not only prevent the Nine-Tails from escaping a defined area, but also to prevent the Third Hokage from entering it.[5] Because the chains are made of the user's chakra, the chains can be produced anywhere the user's chakra resides. When she was the Nine-Tails' jinchūriki, Kushina used the chains to bind the Nine-Tails within her subconscious,[6] and for this reason she never once lost control of its power.[1] After her death, some of Kushina's chakra was sealed within her son, Naruto Uzumaki, allowing her to produce the chains from his body in order to help him combat the Nine-Tails.[2]\nDuring the Fourth Shinobi World War, Karin awakens the ability to produce similar chains, which she uses to lash against and ultimately destroy a wooden opponent. Orochimaru labels this the same ability as Kushina possessed,[7] but Jin no Sho describes it only as a \"glimpse\" of Kushina's Adamantine Sealing Chains.[1]\n\nSee Also[]\nBeast Sealing Technique\nDemonic Statue Chains\nReferences[]\n\n↑ 1.0 1.1 1.2 1.3 1.4 Jin no Sho, page 253\n\n↑ 2.0 2.1 Naruto chapter 498\n\n↑ Naruto: Shippūden episode 408\n\n↑ Naruto chapter 503\n\n↑ Naruto chapter 504\n\n↑ Naruto chapter 501\n\n↑ Naruto chapter 663"}
{"Classification": "Ninjutsu, Clone Techniques", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Body Recreation Technique", "jutsu_description": "Kabuto uses specially-developed snakes to execute the process of recreation and multiplication of another being's cells to create a living clone of them—a process which requires the DNA of the intended target. The spring water produced by The Hole appears to catalyse and speed up the recreation process because of the large \"life force\" flowing through it.[1] The downside to the accelerated rate at which the clone matures is that the snakes composing it have a very short lifespan, resulting in the clone splitting apart and dying after approximately 48 hours.[2]\nOnce the clone is created, Kabuto is able to gain control of it by placing a special talisman into its head. Depending on the talisman used, the clone can either become a mindless tool under Kabuto's control, with eyes possessing black sclera and white irides, or allowed to access their genetic source's personality and memories, while possessing eyes with dark grey sclera and white, snake-like irides. Clones produced through this method are also able to use any abilities possessed by their original selves, including those that they did not naturally acquire.[3] While not in battle, Kabuto stored the clones he created within large snakes, which would burst out of the ground and release their contents when needed.\nKabuto first used this technique to create a clone of Akatsuki member Hidan by placing snakes containing his DNA into the water produced by The Hole, causing them to quickly form into a humanoid shape, and then giving it life with a talisman. Later, snakes which had been ingested by Naruto Uzumaki created a clone of him upon exiting his body; a process which had greatly weakened him over the course of a day and ultimately paralysed him. Unlike the clone of Hidan, this clone did not require the insertion of a talisman to gain life and, due to the influence of Kurama's chakra, was formed in Naruto's four-tailed Version 2 state and possessed a strangely coloured body as well as a tail. The clone was also capable of resisting the control of Kabuto's talisman once it was inserted.[3]"}
{"Classification": "Ninjutsu, Medical Ninjutsu", "Nature": "Lightning Release", "Class": "Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Body Pathway Derangement", "jutsu_description": "This is a high-level form of medical ninjutsu that only Tsunade has been shown to have mastered. Tsunade creates an electric field by giving her chakra the properties of electricity. When she strikes a target with her hand, the electricity pours into their nervous system and rearranges their body's signals. Ordinarily, the brain sends electric signals to the body to control how it moves. But when under the influence of this technique, these signals will produce any movement other than what the brain intends. When used against most opponents, they will be unable to do something as simple as walking, much less continue fighting.[1]\nThe target can partially overcome this technique if they manage to relearn the connection between their brain and their limbs, as Kabuto Yakushi demonstrates. However, this is not an easy feat and takes a high amount of concentration and intelligence.[2]"}
{"Classification": "Kekkei Genkai, Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Body Oxidation Technique", "jutsu_description": "While in smoke form, an Iburi can enter a target through their nostrils and mouth. Once inside, every part of their body can be attacked from the inside by the smoke, causing great pain, and even death."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Body Fluid Shedding Technique", "jutsu_description": "A technique that allows Kabuto to liquefy his body and the snakes he controls at will, which he created after examining and altering the Hōzuki clan's Hydrification Technique. \n\nUsage[]\nBy partitioning parts of his body using his own bodily fluids, Kabuto is able to separate portions of himself in a manner reminiscent of a snake shedding its skin, similar to another technique, while leaving behind only trails of chakra-infused liquid. This allows him to escape from bindings and regenerate from attacks. Due to these resulting trails of fluid, Kabuto can inhibit sensing techniques from detecting him, such as dōjutsu. He can also liquefy his insides to prevent himself from experiencing the harmful effects of intense sound vibrations.[1]\n\nReferences[]\n\n↑ Naruto chapter 580, page 4"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Body Elimination Technique", "jutsu_description": "Knowing full well that a shinobi's corpse is essentially a treasure trove of information, this technique is used by Anbu to completely destroy their body if caught or on the verge of death. This technique leaves no trace of the user's body behind whatsoever."}
{"Classification": "Ninjutsu, General skill", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Body Flicker Technique", "jutsu_description": "The Body Flicker Technique is a high-speed movement technique.\n\nContents\n\n1 Usage\n2"}
{"Classification": "Ninjutsu, Dōjutsu", "Nature": "", "Class": "Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Body Controlling Technique", "jutsu_description": "This is a technique that can be used to control someone's body through direct eye contact. When used, the caster's iris and pupil shrinks and the veins in the sclera become more prominent."}
{"Classification": "Ninjutsu, Chakra Absorption Techniques", "Nature": "", "Class": "Offensive, Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Body Coating", "jutsu_description": "This unique ability possessed by Black Zetsu allows it to take advantage of its malleable body to coat itself over a target. This technique is mainly used to restrict the movement of the target by coating a target's body,[1][2][3] and forcibly make them do its bidding by directly channelling its will through them. In possession of the target's body, Black Zetsu is also able to use target's techniques,[2] kekkei genkai,[4] as well as any other ability they may possess. By using this technique, Black Zetsu can perform various feats including controlling the target, and even stabilising their life force allowing them to live following a mortally-taxing event.[5]\nOnce in contact with a target, they can also absorb[6] the target's chakra and transfer it to others,[7] and even show the target events it has recorded.[7] One drawback of this technique, is that if the target has a strong enough will as in the case of Obito they can suppress Black Zetsu's influence, and take advantage of Black Zetsu being attached to them.[8]"}
{"Classification": "Scientific Ninja Tool Techniques, Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Aerobatic Strike", "jutsu_description": "The user sends the opponent in the air, where they fly blitzing at them before finishing with large beams from their eyes."}
{"Classification": "Kenjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Bluntsword: Spin Strike", "jutsu_description": "Jinin first spins the ax part of his sword, attacking the enemy, and then spins the hammer part, finishing him off."}
{"Classification": "Ninjutsu, Kenjutsu", "Nature": "", "Class": "Offensive, Supplementary", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Bloody Mist Sword Art: Bone Mutilation", "jutsu_description": "The Bloody Mist Sword Art: Bone Mutilation is a technique unique to Kirigakure.[2]\n\nUsage[]\nUsing Hiramekarei, the user creates a large amount of light-blue chakra needles, which are then sent flying at their opponent. Once impaled, the needles disrupt the victim's chakra pathway system, which will then lead to them slowly dying.[2]\n\nReferences[]\n\n↑ Boruto chapter 7, page 28\n\n↑ 2.0 2.1 Boruto: Naruto the Movie novel"}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Blood Transformation Technique", "jutsu_description": "Using the Ketsuryūgan's abilities to manipulate a target's blood, the user can expand the blood in the target's body. Doing so, it will cause the body to morph into a much larger version, effectively disguising the target to be indistinguishable from their true form. By cutting their wrists to expel the extra blood, the target will return to their original state.\n\nSee Also[]\nBody Alteration"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Blood Needle", "jutsu_description": "The user manifests needles made of their own blood from either hand. Upon production, they can be launched as a massive barrage. The force behind these needles are strong, able to plough through the ground.\n\nSee Also[]\nThousand Flying Water Needles of Death"}
{"Classification": "Ninjutsu, Medical Ninjutsu, Regeneration Techniques", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Body Revival Technique", "jutsu_description": "The Body Revival Technique is a high-level medical ninjutsu, and Shinnō's signature technique. \n\nUsage[]\nThe principles of this technique is to take advantage of the muscles' ability to grow stronger after repairing itself from damage. Understanding this theory, the Body Revival Technique can repair the user's body and increase its strength by manipulating the \"Destruction and Rebirth\" cycle of the muscles.\nThis technique allows the user to survive any otherwise normally fatal damage and instantly heal from the damage. A unique trait of this technique is that it can momentarily give the user the appearance of death, fooling even the most talented medical-nins.\nWhen combined with Dark Chakra, this technique can also be used to physically enhance the person's speed, strength and healing capabilities to superhuman levels. It also alters the person's physical appearance drastically, making them younger and more fit in looks, greatly bulking their muscular physique. By Shinnō's claim, this form allows him to perform techniques that are normally taxing for the body, including open all Eight Gates, without any drawbacks. However, if the user loses proper control over the dark chakra while performing this technique, it can cause severe backlash that can destroy the body."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "", "Class": "Offensive", "Range": "Long range (10m+)", "jutsu_name": "Blood Dragon Bullet", "jutsu_description": "A lesser version of the Blood Dragon Ascension, Chino uses the blood around her to create a single Blood Dragon which she sends towards the opponent.\n\nSee Also[]\nWater Release: Water Dragon Bullet Technique"}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "", "Class": "Offensive", "Range": "", "jutsu_name": "Blood Dragon Ascension", "jutsu_description": "Blood Dragon Ascension is a technique that involves the ability of manipulating blood, exclusive of the members of the Chinoike Clan. Through this ability, the user forms a dragon of blood with eight heads similar to the \"Yamata no Orochi\", which all have the ability to regenerate. In addition to the regeneration, the heads of the dragon also have the capacity to release steam after biting a target. The dragon formed is strong enough to restrict the movements of Sasuke Uchiha's Susanoo and was able to withstand his Lightning Release, when Chino used it in conjunction with the iron-rich hot-springs of the Valley of Hell, in the Land of Hot Water."}
{"Classification": "Ninjutsu", "Nature": "Water Release", "Class": "Offensive, Supplementary", "Range": "", "jutsu_name": "Blinding Bubbles Technique", "jutsu_description": "Utakata blows bubbles, surrounding the opponent's face with them. Once popped, the bubbles create a puff of red powder that momentarily blinds the opponent."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu, Fūinjutsu, Chakra Absorption Techniques", "Nature": "", "Class": "Defensive", "Range": "Short range (0-5m)", "jutsu_name": "Blocking Technique Absorption Seal", "jutsu_description": "A highly advanced sealing technique granted by the Preta Path, that conjures a see-through barrier around the user's body that is capable of absorbing any chakra, regardless of any shape or nature transformation, and dispersing it within one's body by spinning the chakra within one's body in the opposite direction. As a result, this technique can absorb any ninjutsu based technique, rendering it ineffective on the user."}
{"Classification": "Ninjutsu, Shurikenjutsu, Cooperation Ninjutsu", "Nature": "Fire Release", "Class": "Offensive, Defensive", "Range": "Short range (0-5m)", "jutsu_name": "Blazing Shuriken Dance", "jutsu_description": "A cooperation technique used by Sasuke and Sakura. Sakura throws a series of shuriken that have been inflamed by Sasuke's Fire Release: Great Fireball Technique.\n\nSee Also[]\nFire Release: Phoenix Sage Flower Nail Crimson"}
{"Classification": "Ninjutsu, Shurikenjutsu, Chakra Flow", "Nature": "Fire ReleaseLightning Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Blazing Lightning Kunai", "jutsu_description": "The user throws fire and lightning infused kunai at their opponent."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "Fire Release", "Class": "Offensive", "Range": "Long range (10m+)", "jutsu_name": "Blaze Release: Yasaka Magatama", "jutsu_description": "Utilising the orb of black flames in his Susanoo's third hand, the user is able to rapidly produce a number of magatama projectiles, which are composed entirely of the flames. Upon impact, victims are forcefully thrown off of their feet and quickly incinerated."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Body Alteration", "jutsu_description": "Gozu can change parts of his body in a manner that is reminiscent of the Akimichi clan's Partial Multi-Size Technique to increase the strength and range of his attacks. Using this ability on his legs also gives him much greater linear speed. Similarly, he can condense his muscle mass to give him even greater speed and agility."}
{"Classification": "Ninjutsu, Kenjutsu, Chakra Absorption Techniques", "Nature": "Water Release", "Class": "Supplementary", "Range": "All ranges", "jutsu_name": "Bloody Mist Absorption Technique", "jutsu_description": "The user swipes their blood across Samehada, creating a contract. The blade unleashes a thick red mist on the battlefield, gradually and continually absorbing chakra from all opponents' open wounds.\n\nSee Also[]\nCrimson Mist Barrier Technique\nEarth Release Barrier: Earth Prison Dome of Magnificent Nothingness\nHiding in Mist Technique"}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu, Senjutsu, Cooperation Ninjutsu", "Nature": "Fire Release", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Blaze Release: Susanoo Ōdachi", "jutsu_description": "Jūgo applies his senjutsu chakra to Sasuke's Susanoo. Sasuke extends his Susanoo's sword to several times the size of the Susanoo itself, and converts it to black flames, delivering a long-reaching, downwards slash."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "Fire Release", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Blaze Release: Susanoo Kagutsuchi", "jutsu_description": "An application of Kagutsuchi through Susanoo, whereby Sasuke produces weapons made from the orb of black flames held in his Susanoo's secondary right hand.\n\nVariants[]\nThe black flames can form a sword to be wielded by Susanoo, which is able to stab and slice through individuals or defences, incinerating whatever remains.[1][2]\nMagatama-shaped projectiles can be unleashed from the orb in volleys, knocking back and subsequently incinerating their targets.[3]\nThis technique can produce arrows to be utilised with Susanoo's bow.[4]"}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "Fire Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Blaze Release: Great Fireball Technique", "jutsu_description": "The user launches a fireball at the opponent, with the black flames enveloping the orange-coloured fire for increased substantial damage."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "Fire Release", "Class": "Offensive", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Blaze Release: Kagutsuchi — Flying Flame", "jutsu_description": "Sasuke creates a sword of black flames and swings it, unleashing a wave of controlled flames towards the opponent."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "Fire Release", "Class": "Offensive, Defensive", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Blaze Release: Kagutsuchi", "jutsu_description": "Blaze Release: Kagutsuchi is a technique which applies shape transformation to the black flames of Amaterasu, allowing the user to manipulate them at will. In Sasuke Uchiha's case, while Amaterasu is cast from his left eye, he uses his right eye to manipulate the flames.[2]\n\nContents\n\n1 Variants\n2 Influence\n3"}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu, Kenjutsu, Chakra Flow", "Nature": "Fire ReleaseLightning Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Blaze Release: Kagutsuchi — Heaven Step", "jutsu_description": "Sasuke attacks his opponent with a lightning-chakra infused sword, throwing them upwards, and causes Amaterasu spikes to erupt from the ground, hitting them in the air."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "Fire Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Blaze Release: Kagutsuchi — Porcupine", "jutsu_description": "Sasuke focuses the flames of Amaterasu at his opponent, shaping them into several spikes, damaging his opponent and knocking them back."}
{"Classification": "Ninjutsu, Barrier Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "All ranges", "jutsu_name": "Blinding Wide Sand Formation: Noise", "jutsu_description": "The user spreads sand particles throughout the area, creating a sensing barrier (感知結界, kanchi kekkai) that disrupts the enemies' ability to sense targets. However, the technique appears only able to work on targets focused on."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "Fire Release", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Blaze Release: Dragon Flame Release Song Technique", "jutsu_description": "The user spews dragon shaped flames coated in black flames."}
{"Classification": "Ninjutsu, Taijutsu", "Nature": "Wind Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Blade of Wind Barrage", "jutsu_description": "Baki covers his hands with the Blade of Wind, delivers a barrage of punches to the opponent, and then finishes them off with an uppercut which creates a large gust of wind throwing the opponent into the air."}
{"Classification": "Kekkei Genkai, Ninjutsu, Shurikenjutsu", "Nature": "Ice Release", "Class": "Offensive", "Range": "Mid range (5-10m)", "jutsu_name": "Blasting Ice Crystal", "jutsu_description": "Haku firsts traps the opponent's feet to the ground by freezing ice onto them. He then uses a specific hand seal which causes the chunks of ice at the opponent's feet to grow into one large chunk, freezing the target completely. Quickly jumping back, he throws several senbon at the frozen opponent. It partially cracks the chunk of ice, and then shatters outward, damaging the opponent once more."}
{"Classification": "Ninjutsu", "Nature": "Wind Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Blade of Wind Hurricane", "jutsu_description": "Baki creates a large hurricane using his Blade of Wind technique that draws enemies into the hurricane, violently slashing them."}
{"Classification": "Kenjutsu, Bukijutsu", "Nature": "", "Class": "Offensive, Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Blastsword: Earth Rupture", "jutsu_description": "Jinpachi thrusts his sword into the ground, creating a series of powerful explosions, breaking the ground under the enemy's feet, and then, while they are disoriented, he finishes with a blow of the sword."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "Fire Release", "Class": "Offensive, Defensive", "Range": "Short range (0-5m)", "jutsu_name": "Blaze Release: Honoikazuchi", "jutsu_description": "The user first surrounds themselves with Amaterasu before proceeding to shape them into spikes, impaling anyone within their immediate vicinity.\n\nInfluence[]\nHonoikazuchi is one of eight thunder gods that were born from Izanami's body in the underworld, specifically from her chest."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "Fire Release", "Class": "Offensive, Defensive", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Blaze Release: Flame Formation Wall Technique", "jutsu_description": "The user spews normal flames covered in black flames, which surround the user and damage anyone that is near the flames."}
{"Classification": "Hiden, Ninjutsu", "Nature": "Yin Release", "Class": "Offensive, Supplementary", "Range": "All ranges", "jutsu_name": "Black Spider Lily", "jutsu_description": "After trapping the target with the Shadow Sewing Technique, the user can then manipulate the shadow to bring them closer to themselves. This technique can be used to draw multiple enemies into the range of Inoichi's Mind Disturbance Dance Performance Technique."}
{"Classification": "Taijutsu, Collaboration Techniques", "Nature": "", "Class": "Offensive", "Range": "", "jutsu_name": "Black Tornado", "jutsu_description": "The Kurosuki Family members pile up one on top of the other, five in one pillar, and then send out their gloves' retractable blades and hold out their arms. They then proceed to spin, creating a black tornado-looking attack. The speed makes the attack so powerful that the blades can easily cut through stone."}
{"Classification": "Genjutsu, Kenjutsu", "Nature": "Yin Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Blade Concealed in Glamour", "jutsu_description": "The user traps their target inside a genjutsu in which the user proceeds to use a kunai to deliver a swift slash while the opponent is fully immobilised."}
{"Classification": "Ninjutsu", "Nature": "Wind Release", "Class": "Offensive", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Blade of Wind", "jutsu_description": "Baki emits chakra from his fingertips, creating an invisible sword out of wind that he attacks opponents with. Because opponents can't see it, and because of how precise Baki can be with his attacks, there is little opponents can do to defend against this technique. The Blade of Wind is to the Sickle Weasel Technique what a longsword is to a kunai.[1]"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Black Secret Technique Revolving Flame Arson", "jutsu_description": "Kankurō withdraws Sanshōuo from storage and causes it to spit fire onto the opponent while being guarded by its armour."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Defensive, Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Black Secret Technique: Salamander", "jutsu_description": "Kankurō hides Sanshōuo under ground, and when it is positioned under the opponent, it emerges and captures the target inside of it.\n\nReferences[]\n\n↑ Fourth Databook, page 317"}
{"Classification": "Kekkei Genkai, Ninjutsu, Fūinjutsu", "Nature": "Magnet Release", "Class": "Supplementary", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Black Secret Technique: Black Iron", "jutsu_description": "Shinki encases his target with Iron Sand, then proceeds to summon his puppet that bites down on the target, which results in a fūinjutsu formula that temporarily seals said target's movement as Shinki completely buries them in a casket of Iron Sand.\n\nSee Also[]\nDesert Layered Imperial Funeral Seal"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Black Secret Technique — Machine Triple Shot", "jutsu_description": "This technique is simply the Black Secret Technique Machine One Shot technique adapted for two targets. Kankurō summons two Kuroari puppets to capture the enemies. He then uses Karasu to impale one of the victims, while an ally attacks the other.  \n\nReferences[]\n\n↑ Fourth Databook, page 251"}
{"Classification": "Kenjutsu, Bukijutsu", "Nature": "", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Blastsword Technique: Blasting Bridle Repeating Death", "jutsu_description": "Unravelling a large length of the explosive tag roll from the Shibuki, Jinpachi sends it towards his enemy in a circular motion cutting off any escape route and engulfing them in a wide-spread explosion.\n\nReferences[]\n\n↑ Naruto: Ultimate Ninja Online"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Black Secret Technique Manipulated Flame Scorpion Play", "jutsu_description": "Kankurō sends out Sasori, throwing the opponent up in the air. While in the air, Kankurō activates Sasori's flamethrowers, ever increasing their intensity. Then, Kankurō finishes it by having Sasori perform a slashing motion with the flames."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Black Secret Technique Machine Two Shot", "jutsu_description": "The enhanced version of Black Secret Technique Machine One Shot which doesn't require Karasu. After making a distraction, Kankurō manoeuvres Kuroari behind the target, which then opens up its chest and fires out chakra strings that wrap around its intended target. It then pulls the target into its open abdominal cavity. With the victim trapped, scythe like blades appear and reap through one side of the puppet to the other, killing the victim inside."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Black Secret Technique Machine One Shot", "jutsu_description": "This is a \"dance of death\" that Kankurō performs with puppets. He first uses Karasu, an attacking puppet, to strike at the target, causing targets to focus their attention on it. As they avoid its attacks, they are unwittingly navigated towards Kuroari, a capturing puppet, which seals them within its body. While they're trapped inside Kuroari, Karasu's head and six limbs are separated from its body, each of which has its own concealed blade. The seven blades are simultaneously inserted into slots on Kuroari's body, killing the target inside.[1]"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Black Secret Technique Flame Filling Flower", "jutsu_description": "Kankurō uses his puppet Sanshōuo to release a huge burst of fire at the opponent."}
{"Classification": "Ninjutsu, Taijutsu, Cooperation Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Black Passing Secret Fang Technique Machine One Shot", "jutsu_description": "Kankurō sends the opponent into the air where Kiba connects a kick. Kiba then uses his Passing Fang to force the opponent into Kuroari, allowing Kankurō to perform Black Secret Technique Machine One Shot."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "", "Class": "Offensive, Supplementary", "Range": "All ranges", "jutsu_name": "Black Receiver", "jutsu_description": "Black Receivers are black rods that function as demodulators for high-frequency chakra signals.[11] Users are able to create and transmit their chakra into these receivers for a variety of purposes.\n\nContents\n\n1 Origin\n2 Usage\n3"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Black Rain", "jutsu_description": "Nagato rains down Black Receivers and attacks, firing at enemies around him."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Black Secret Technique: Three Great Tragedies", "jutsu_description": "Kankurō uses this technique with Karasu, Kuroari and Sanshōuo. First, Sanshōuo slams the opponent in the air, then Karasu slashes them several times. After this, the near-unconscious foe is carried by Kuroari in front of Sanshōuo, who opens its mouth to reveal a cannon of sorts, which blasts the opponent in the air."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Black Secret Technique: Three Great Kyōgen", "jutsu_description": "Kankurō has Sanshōuo tackle the opponent from underneath the ground, immediately after which Karasu catches the opponent mid-air and carries them into Kuroari. The puppet then triggers an explosion, but not before splitting its parts to sustain itself from damage."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Black Needle Stab", "jutsu_description": "Pain runs to an opponent and stabs them with his black receiver, messing with their actions."}
{"Classification": "Ninjutsu, Fighting Style", "Nature": "Lightning Release", "Class": "Offensive", "Range": "Long range (10m+)", "jutsu_name": "Black Lightning", "jutsu_description": "Black Lightning is a unique form of Lightning Release utilised by the Third Raikage, who passed it on to Darui alone.[1] Not much is known about it, but as the name suggests, the lightning produced is black in colour."}
{"Classification": "Kekkei Genkai, Ninjutsu", "Nature": "Magnet ReleaseLightning Release", "Class": "Offensive, Defensive", "Range": "All ranges", "jutsu_name": "Black Iron Fist", "jutsu_description": "Shinki creates a large hand out of Iron Sand that he can manipulate using electromagnetic fields. He can have the hands clamp around himself to protect against attacks, as well as can be used to attack a target from a distance.\n\nSee Also[]\nDesert: Hand\nMagnet Release: Lightning God Self"}
{"Classification": "Kekkei Genkai, Shinjutsu, Hiden, Dōjutsu", "Nature": "", "Class": "Offensive, Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Black Holy Hammer", "jutsu_description": "The user brings forth an enlarged black rod to pin down the opponent from making any further movement."}
{"Classification": "Kekkei Genkai, Genjutsu, Dōjutsu", "Nature": "Yin Release", "Class": "Offensive, Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Black Dream", "jutsu_description": "Itachi traps the opponent in a Tsukuyomi, causing them to see the ground beneath their feet to break open, plummeting them into a huge chasm. It is described as a bottomless pit of pain. \n\nSee Also[]\nSharingan: Negative Confusion"}
{"Classification": "Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Biting Cut", "jutsu_description": "Kabuto grabs his opponent with his navel snake, and pulls himself toward them, unhinging his jaw and biting them."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Binding Smoke Prison", "jutsu_description": "After dispersing his smoke clones, Kigiri uses the smoke made up from their bodies to wrap around the target and restrain them."}
{"Classification": "Ninjutsu, Space–Time Ninjutsu", "Nature": "", "Class": "Offensive, Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Binding Snake Glare Spell", "jutsu_description": "The user summons one or two big snakes which crawl out from one's sleeves, and coil around the enemy capturing them. This is a great technique for capturing someone alive, or for inflicting damage by constriction, and if the situation calls for it, the snakes can bite the victim with their poison fangs. With the summons specified beforehand, the procedure can be shortened by using blood on a summoning \"contract seal\" (結印, ketsuin), making it possible to use the technique immediately. The further addition of the user's killing intent can weaken their target's resolve.\nSnakes summoned by this technique are on a whole other level in terms of intelligence and strength, compared to normal summons. It is said that even shinobi with great skill are unable to escape from this restraint.\n\nReferences[]\n\n↑ Sha no Sho, page 266"}
{"Classification": "Ninjutsu, Senjutsu, Kinjutsu", "Nature": "Wind Release", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Big Ball Rasenshuriken", "jutsu_description": "The Big Ball Rasenshuriken is a larger variant of the Wind Release: Rasenshuriken.\n\nUsage[]\nBy using two shadow clones and his Wind Release nature transformation, Naruto is able to form a Rasengan in the form of a shuriken. The sphere in the technique's centre is considerably larger compared to that of the Rasenshuriken's standard variant. The user can also keep adding chakra to the technique causing it to expand to enormous proportions. In this enormous version, Rasenshuriken shines very brightly in the dark. When thrown it causes a tremendous wind sphere upon detonation that can be seen from several kilometres away, and is enough to even neutralise a reincarnated Madara Uchiha long enough to be restrained, while simultaneously destroying both of Hashirama's wood dragons."}
{"Classification": "Senjutsu, Ninjutsu, Kinjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Big Ball Spiralling Serial Spheres", "jutsu_description": "Naruto creates multiple shadow clones that dive onto the opponent like missiles while the real Naruto finishes with two Big Ball Rasengan."}
{"Classification": "Ninjutsu, Senjutsu, Kinjutsu", "Nature": "Wind Release", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Big Ball: Tailed Beast Rasenshuriken", "jutsu_description": "While donning his Kurama chakra cloak, Naruto infuses an enlarged Tailed Beast Ball with his wind-natured chakra, before throwing it at a target, creating a great explosion upon contact."}
{"Classification": "Ninjutsu, Senjutsu", "Nature": "Fire ReleaseWind ReleaseLightning ReleaseEarth ReleaseWater ReleaseYin–Yang Release", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Big Truth-Seeking Ball", "jutsu_description": "The user can merge their Truth-Seeking Balls to form a ball larger in size. They can also merge a pair of two to have a larger sized set. In the games, merging all the balls into one have a multitude of uses."}
{"Classification": "Hiden, Ninjutsu, Kinjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Biguro", "jutsu_description": "This technique allows the user to manipulate their tendrils and then sends them underground. They then appear underneath their target piercing them multiple times."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Big Ball Rasengan", "jutsu_description": "The Big Ball Rasengan is a more powerful version of the Rasengan.\n\nContents\n\n1 Overview\n2 Usage and Improvement\n3 Senjutsu Influence\n4"}
{"Classification": "Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Beheading Prison Chop", "jutsu_description": "A delivers a series of strikes to the opponent, sending them flying into the air. Then, he jumps and delivers a Lightning Oppression Horizontal Chop at the opponent — although without lightning — and smashes the opponent into the ground."}
{"Classification": "Kenjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Beigoma", "jutsu_description": "Mifune jumps up the air, delivers a few slashes, and finishes it with a powerful spinning slash that sends his opponent crashing into the ground."}
{"Classification": "Ninjutsu, Kinjutsu, Clone Techniques", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Big Ball Spiralling Serial Zone Spheres", "jutsu_description": "After performing the Multiple Shadow Clone Technique, Naruto creates several Big Ball Rasengan. The clones then charge towards the target in horizontal line formation and slam their Rasengan into the target, causing a massive amount of damage."}
{"Classification": "Ninjutsu, Shurikenjutsu, Chakra Flow", "Nature": "Lightning Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Bell-Flowered Lightning Blade", "jutsu_description": "Kakashi throws several Lightning Release kunai, which reveal hidden enemy traps and set up an electric field against opponents."}
{"Classification": "Ninjutsu, Barrier Ninjutsu", "Nature": "", "Class": "Defensive", "Range": "Short range (0-5m)", "jutsu_name": "Bell Barrier Technique", "jutsu_description": "This is a technique in which Shion's bell projects a hologram around the individual that is currently holding the bell, intercepting any damage that may pose a threat to them. Miroku says that nothing could destroy it and with its properties, Shion would be fully protected. She still has the power to explode threats that abut, as she did with the body of Mōryō."}
{"Classification": "Hiden, Ninjutsu, Clone Techniques", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Beeswax Clone", "jutsu_description": "The user makes a clone made of beeswax and when injured enough it dissolves back down into wax."}
{"Classification": "Hiden, Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Mid to Long range (5m+)", "jutsu_name": "Bee Bomb Technique", "jutsu_description": "This is a technique in which bees bombard the target with explosions detonated by the explosive tags attached to them."}
{"Classification": "Hiden, Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Beast-Human Needle Senbon", "jutsu_description": "In their transformed state, a Tenrō clan shinobi can shoot their hair like needles in all directions.\n\nSee Also[]\nNeedle Hell"}
{"Classification": "Ninjutsu", "Nature": "Wind Release", "Class": "Offensive, Defensive, Supplementary", "Range": "All ranges", "jutsu_name": "Beast Tearing Gale Palm", "jutsu_description": "This technique is somewhat of an enhanced version of the Beast Tearing Palm. It uses chakra to infuse with and condense a mass amount of wind-chakra to form a massive demonic-like claw extending from the user's hand to strike and grab a target, as well as deflect any weapon or attack. Depending on its use, the user can manipulate the size and length of the claw to attack and defend at any range. In addition to making it a deadly weapon, the extending claw also carries tremendous force that can devastate anything in its path without affecting the user, making it useful for dislodging solid and heavy objects.\n\nSee Also[]\nTailed Beast Chakra Arms\nReferences[]\n\n↑ Naruto Collectible Card Game"}
{"Classification": "Ninjutsu", "Nature": "Wind Release", "Class": "Offensive", "Range": "Mid to Long range (5m+)", "jutsu_name": "Beast Tearing Palm", "jutsu_description": "A powerful technique of wind nature chakra that can cut and slash through any material. Sora activates it by summoning chakra in his right hand, and then swipes a slicing chakra wave which appears to be controlled by Sora's will and thoughts. He is also able to use the technique in a rapid-fire, successive motion. This technique became stronger when Sora was in the influence of the Nine-Tailed Demon Fox's chakra and instead of the usual blue colour, it was red.\n\nSee Also[]\nBlade of Wind\nWind Release: Vacuum Wave\nWind Release: Wind Cutter Technique"}
{"Classification": "Ninjutsu, Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Big Ball Rasengan: Rising Attack", "jutsu_description": "After Naruto and his clones land a string of kicks and punches, Naruto summons a group of clones to fly up and ram the opponent in rapid succession, then quickly creates two clones to form the Big Ball Rasengan who jump off his back to reach the mid air opponent and strike them with it."}
{"Classification": "Hiden, Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Beast-Human Fury Kicks", "jutsu_description": "In their transformed state, a Tenrō clan shinobi delivers a multitude of powerful kicks to the opponent."}
{"Classification": "Ninjutsu, Fūinjutsu", "Nature": "", "Class": "Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Beast Sealing Technique", "jutsu_description": "After creating the necessary seals, the seal formula rises up in the form of multiple chakra chains and binds the target.\n\nSee Also[]\nAdamantine Sealing Chains\nDemonic Statue Chains"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Bat Controlling: Ultrasonic Mind Waves", "jutsu_description": "Once Rinji controls his bats, he commands them to produce high frequency ultrasonic waves that affect the mind of the opponent.\nThese bats (along with Shino's evolving insect strategy) have been the only effective counters to the Crystal Release. The ultrasound waves move at a frequency that allowed the crystal to breakdown at a molecular level, allowing dispersion of crystal particles back into the air."}
{"Classification": "Hiden, Ninjutsu", "Nature": "", "Class": "Offensive, Supplementary", "Range": "All ranges", "jutsu_name": "Bee Honey Technique", "jutsu_description": "The user summons a large number of bees that swarm over and sting the opponent. Every time a bee is injured or destroyed, it releases sticky honey on the opponent, which is strong enough to immobilise them. This is particularly effective against opponents who rely on close range physical attacks, such as practitioners of the Gentle Fist."}
{"Classification": "Ninjutsu, Clone Techniques", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Beast Human Clone", "jutsu_description": "An \"Imitation Human Ninja Art\" (擬人忍法, Gijin Ninpō), this technique transforms a ninken into their Inuzuka partner. By doing this, the Inuzuka gains a copy of themselves that serves the same practical purpose as a shadow clone but without a shadow clone's steep chakra requirement. Even though they look identical, the ninken - because it's an animal - is likely to give away which of the two is which from how it moves and acts. To counteract this, the Inuzuka typically uses an Imitation Beast Ninja Art, causing them to act more feral and thus make it harder to tell them apart.[1] As with any transformation, the ninken will revert to their original form if they're knocked out.[2]\nWhen the Beast Human Clone is first used during the Chūnin Exams arc, Akamaru is seemingly the one to use this technique after he's been fed a soldier pill.[3] When it's used again during the Sasuke Recovery Mission, it is seemingly performed by Akamaru's partner, Kiba Inuzuka, instead.[4] On both occasions, the Beast Human Clone's use typically precedes the Fang Passing Fang. By Part II, the Beast Human Clone no longer seems necessary for Kiba and Akamaru's manoeuvres, presumably because Akamaru's natural size is much closer to Kiba's than it was in Part I."}
{"Classification": "Ninjutsu, Bukijutsu", "Nature": "Water Release", "Class": "Offensive", "Range": "Long range (10m+)", "jutsu_name": "Bashōsen: Coil of Water", "jutsu_description": "Waving the Bashōsen, the user unleashes a torrent of water which chases after their opponent.\n\nSee Also[]\nBashōsen: Coil of Earth\nBashōsen: Coil of Fire\nBashōsen: Coil of Lightning\nBashōsen: Coil of Wind"}
{"Classification": "Ninjutsu, Bukijutsu", "Nature": "Wind Release", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Bashōsen: Coil of Wind", "jutsu_description": "Swinging the Bashōsen, the user creates a powerful gust of wind which was powerful enough to destroy Kakuzu's lightning-mask.\n\nSee Also[]\nBashōsen: Coil of Earth\nBashōsen: Coil of Fire\nBashōsen: Coil of Lightning\nBashōsen: Coil of Water\nSickle Weasel Technique\nTyphoon Impact\nWind Release: Great Sickle Weasel Technique"}
{"Classification": "Ninjutsu, Bukijutsu", "Nature": "Lightning Release", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Bashōsen: Coil of Lightning", "jutsu_description": "Waving the Bashōsen downwards, the user causes lightning to surge around them.\n\nSee Also[]\nBashōsen: Coil of Earth\nBashōsen: Coil of Fire\nBashōsen: Coil of Water\nBashōsen: Coil of Wind"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Bat Controlling", "jutsu_description": "Rinji has the special ability to produce ultrasonic waves and understand them. This way he can talk with bats, who use ultrasonic waves for communication. He is able to give them orders, like to search the area around him, and they seem to consider him a friend. He can use these bats to release powerful sonic waves."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Baryon Rasengan", "jutsu_description": "Naruto performs a Rasengan while in Baryon Mode."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Baryon Rasengan: Heaven Pierce", "jutsu_description": "Naruto performs a Rasengan while in Baryon Mode."}
{"Classification": "Ninjutsu, Bukijutsu", "Nature": "Earth Release", "Class": "Offensive", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Bashōsen: Coil of Earth", "jutsu_description": "Waving the Bashōsen down towards the ground, the user then unleashes a row of rising earth towards the opponent.\n\nSee Also[]\nBashōsen: Coil of Fire\nBashōsen: Coil of Lightning\nBashōsen: Coil of Water\nBashōsen: Coil of Wind"}
{"Classification": "Ninjutsu, Bukijutsu", "Nature": "Fire Release", "Class": "Offensive", "Range": "Mid range (5-10m)", "jutsu_name": "Bashōsen: Coil of Fire", "jutsu_description": "Using the Bashōsen, the user waves the fan and unleashes an enormous trail of intense flames which torrents towards their intended target.\n\nSee Also[]\nBashōsen: Coil of Earth\nBashōsen: Coil of Lightning\nBashōsen: Coil of Water\nBashōsen: Coil of Wind\nReferences[]\n\n↑ Fourth Databook, page 324"}
{"Classification": "Ninjutsu, Taijutsu", "Nature": "", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Baryon: Scarlet Flash", "jutsu_description": "In Baryon Mode, Naruto uses his enhanced speed to blitz through all the opponents in the surrounding area.\n\nSee Also[]\nTailed Beast Flash Bullet"}
{"Classification": "Ninjutsu, Fūinjutsu, Barrier Ninjutsu", "Nature": "", "Class": "Defensive", "Range": "Short range (0-5m)", "jutsu_name": "Barrier Talisman: Armoured Eye", "jutsu_description": "This technique was created by the hunter-nin of Kirigakure and according to Ao, they are the only ones who know how to cancel the technique.[2] When a specific part of the user's body is targeted, this technique is automatically activated. The talismans move to cover the specific body part and form a barrier to protect it. \nAo wears these talismans as earrings as a precaution should anyone try and target the Byakugan in his right eye socket. These talismans have the kanji for a humble form of \"to hear\" (承, shō, uketamawa(ru)) on both sides.\n\nReferences[]\n\n↑ Fourth Databook, page 318\n\n↑ Naruto chapter 471, page 6"}
{"Classification": "Ninjutsu, Barrier Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Barrier: Canopy Method Formation", "jutsu_description": "This technique allows the user to create a spherical detection barrier with the user at the centre. At the user's command, the detection barrier can expand, grasping everything in the surroundings. The users can also detect anything that moves inside the barrier space with their own \"sense\". As the users move, the barrier will follow them."}
{"Classification": "Ninjutsu, Cooperation Ninjutsu, Barrier Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "All ranges", "jutsu_name": "Barrier: Reclose Technique", "jutsu_description": "A technique used by the shinobi from the Allied Shinobi Forces' Sealing Team. After performing the required hand seals, a barrier is erected to re-close an opening of an pre-existing barrier."}
{"Classification": "Ninjutsu, Barrier Ninjutsu, Space–Time Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Barrier: Toad Gourd Prison", "jutsu_description": "This technique summons a small, gourd-shaped toad, called a \"Gourd Toad\" (瓢箪蝦蟇, Hyōtan Gama), a unique species of toad indigenous to Mount Myōboku. By using the toad's tongue to drag in whatever it wraps around, this technique is best used to capture and isolate a victim dragging them into the toad's stomach. Isolated from the outside world by a barrier, the dimension sealed inside the Gourd Toad's stomach is far larger than the size of the Gourd Toad itself. Even if at a moment's notice, only the technique's caster can freely enter and exit the isolated space. Should the need arise, the toad can be used to transport whatever it has captured, releasing its contents when given the command.\nThe environment inside the toad's stomach is a cavernous chamber, which includes a lake of strong corrosive gastric acid that can dissolve anything that should happen to fall into it, along with shores around the acid lake, and rock formations sticking out of the lake; the already-existing structures within the Toad's stomach are seemingly unaffected by the acid lake. Once trapped inside, an opponent is cut off from any allies and susceptible to attack, and can then be easily defeated.\n\nReferences[]\n\n↑ Sha no Sho, page 253"}
{"Classification": "Kenjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Battōjutsu", "jutsu_description": "The user attacks the enemy with a sword at an incredible speed, causing a flash and a gust of wind upon impact, raising dust from the ground."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive, Defensive, Supplementary", "Range": "", "jutsu_name": "Baryon Mode", "jutsu_description": "This article is about the jutsu. For Boruto chapter 52, see Baryon Mode.\n\n\n\nBaryon Mode (重粒子モード, Barion Mōdo) is a unique transformation accessible to Kurama with its jinchūriki.\n\nContents\n\n1 Overview\n2 Drawbacks\n3"}
{"Classification": "Ninjutsu, Barrier Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "", "jutsu_name": "Barrier Method Formation", "jutsu_description": "This is a type of trap ninjutsu (トラップ忍術, Torappu ninjutsu) where an area is defined using a number of special tags. When the area is entered by an opponent, a barrier is created. The barrier's properties vary depending on the tags used:[1] the Sound Four, for example, use explosive tags, which allows it to serve as a sort of booby-trap.[2] To prevent the trap from being noticed, the individual tags are placed in hidden locations, such as the shade of trees. Even if the tags are discovered, actually disarming them is very difficult, for which reason it's generally safer to simply avoid the area.[1] Shikaku Nara once forced his son, Shikamaru, to read a book that discussed this technique, which described it as \"a high-class ninjutsu\".[2]"}
{"Classification": "Ninjutsu, Fūinjutsu", "Nature": "", "Class": "Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Barrier Releasing Technique", "jutsu_description": "The user places four tags marked \"Release\" in a diamond formation on a barrier. After performing the hand seals, the technique will break the barrier. It takes time and concentration to break stronger barriers. To increase the strength of this technique, more than one user can perform the technique in unison.\n\nSee Also[]\nBarrier Shattering Technique"}
{"Classification": "Ninjutsu, Barrier Ninjutsu", "Nature": "", "Class": "Defensive", "Range": "Long range (10m+)", "jutsu_name": "Barrier Gate Five Seals Technique: Castle Closing Eight Gates", "jutsu_description": "This technique requires a scroll on which a blueprint of a particular area will be mapped. When activated, it causes four giant gates to emerge north, east, south, and west of the targeted area. Afterwards, the gates form a barrier around the area. This barrier has a very high durability, and anything that makes contact with it is immediately engulfed in flames. The only way to pass through the barrier unharmed is with a special seal."}
{"Classification": "Ninjutsu, Barrier Ninjutsu, Fūinjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Barrier Method Formation — Triple Formula", "jutsu_description": "Iruka applies three simultaneous sealing formulas on the floor, side by side. Each causes an explosion if the opponent is caught up in them, and explode on their own after a while if no opponent triggers them."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive, Defensive, Supplementary", "Range": "", "jutsu_name": "Baryon Tail Breaker", "jutsu_description": "The user uses their chakra tails to deflect or stop any incoming attacks.\n\nSee Also[]\nTailed Beast Chakra Arms\nReferences[]\n\n↑ Naruto x Boruto: Ninja Voltage"}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "", "Class": "Supplementary", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Banshō Ten'in", "jutsu_description": "This article is about the technique. For chapter 435, see Banshō Ten'in.\n\n\n\nBanshō Ten'in is a technique that manipulates attractive force (引力, inryoku) to pull matter towards the user at will. It has the same five second limit as the Shinra Tensei as stated by Chōji Akimichi.[2] The area of effect can be localised, so it is possible to selectively attract a target or targets without affecting the object or the structure they're connected to.[3][4] It is also possible to attract multiple targets at once, causing them to collide with each other.[4] The ability to manipulate attractive forces with this technique is granted by the Deva Path much like its counterpart Shinra Tensei.\n\nOther Media[]\nAn enhanced, \"Full Throttle\" version of Banshō Ten'in appears in Naruto Shippūden: Shinobi Rumble, called \"Banshō Ten'in: Dōmetsu\" (万象天引・導滅, literally meaning: Heavenly Attraction of All Creation: Guiding Destruction).\nIn Naruto Shippūden: Ultimate Ninja Impact, Nagato can also use it to lift the ground and throw it at the opponent, called \"Banshō Ten'in: Jidō\" (万象天引・地動, literally meaning: Heavenly Attraction of All Creation: Ground Motion).\n\nInfluence[]\nThe names of Banshō Ten'in and its companion ability, Shinra Tensei, are derived from Shinra Banshō (神羅万象, literally meaning: Everything Covered by God), a Japanese four-character idiom and homophone variant of Shinra Banshō (森羅万象, literally meaning: All-Covering Forests and Ten Thousand Things), a Buddhist idiom which has come to mean \"All Nature\" or \"All Creation\"."}
{"Classification": "Taijutsu", "Nature": "Yang Release", "Class": "Offensive, Defensive", "Range": "Short range (0-5m)", "jutsu_name": "Ballistic Waterwheel", "jutsu_description": "After the user swallows a great amount of water to make themselves into a human-sized ball, they tuck their limbs inside their clothes and use chakra to propel themselves into a powerful roll. The added water gives the user extra weight, causing more damage to the opponent and area. This is an excellent technique to use against Water Release users as it not only nullifies their attack but also turns it against them."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Defensive, Supplementary", "Range": "", "jutsu_name": "Bando's Chakra Armour", "jutsu_description": "Bando activates his chakra to surround him in a blazing yellow armour of pure chakra. Damage to Bando in this state is reduced greatly. His attacks are also amplified by the armour."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Ball of Light Technique", "jutsu_description": "The user gathers a ball of concentrated light which hovers above their palm to illuminate their surroundings, similar to a lantern."}
{"Classification": "Ninjutsu, Chakra Flow, Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Baryon Bullet Barrage", "jutsu_description": "The users rushes on the opponent with a barrage of punches covered in chakra."}
{"Classification": "Taijutsu, Shurikenjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Avalanche Dance", "jutsu_description": "Haku delivers a string of kicks, punches, and senbon slashes to his opponent, throws them up in the air while performing a back flip, and jumps higher than his opponent to throw senbon at them."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "", "Class": "Offensive, Defensive", "Range": "", "jutsu_name": "Asura Path", "jutsu_description": "This article is about information on the ability. For information on the character, see Asura Path. For other uses, see Asura (disambiguation).\n\n\n\n\nThe Asura Path (修羅道, Shuradō) grants the user the ability to augment their own body to summon mechanised armour and various ballistic and mechanical weaponry.[2]  During his lifetime, Nagato channelled the Asura Path through the body of a ninja puppeteer.\n\nContents\n\n1 Usage\n2 Mechanisms\n3 Influences\n4 References\n\n\nUsage[]\nThrough the Asura Path, the user is able to form up to four additional arms and two additional faces, as well as a folded, serrated blade-like sash around their waist. These additional appendages, as well as the user's body as a whole, are augmented with a variety of mechanical weaponry, which they can access at will. The user can fire their forearms as long-range projectiles or pull them off to reveal and fire a cluster of segmented missiles at targets. They are also able to protrude a set of flexible blades and drills or a series of mechanical tendrils from their arms, as well as quickly propel themselves forward by emitting a burst of chakra from holes in their feet. The user can also release a powerful chakra blast, which is capable of destroying numerous buildings at once, either by transforming one of their hands into a cannon or by opening the crown of their head.\nThe body through which Nagato channelled the Asura Path displayed enough raw physical power to rip Jiraiya's arm off and crush his throat with basic taijutsu, as well as to throw the Animal Path all the way into Konohagakure from the outskirts of the village. Additionally, the Asura Path was able to survive otherwise fatal damage due to its mechanised insides. All of these abilities befitted the \"warring demon\" name that the Asura Path held, whilst giving it a considerable degree of versatility.\n\n\nMechanisms[]\nThe detached hand being launched.As displayed through Nagato's Path, not only was the arm detachable, but a cluster of segmented missiles produced from within it.The arm itself could be used as a launching pad to launch the missiles.The Path's head opening up to reveal a cannon.The Path being propelled with mechanisms from the feet. The right hand also shows additional weapons being produced.Additional arms being equipped in battle.\nInfluences[]\nIn Buddhism, the Asura realm is the plane of semi-divine warring demons which people are reincarnated in due to actions based on jealousy, struggle, combat or rationalisation in a previous life, and though powerful, live in constant violence and conflict to which there is no resolution nor peace. Following a common depiction of Asura, this ability allows the user to possess six arms and three faces, each of which display a different emotion. Like Deva, Asura are also a race of supernatural beings. They are also featured in Hinduism as divine beings, and are known to live a life pursuing power, while indulgent and representative of materialistic and carnal pleasures. Both depictions play in the abilities of the Asura Path.\nIt also draws inspiration from Hinduism, where Asuras in mythology purportedly had the ability (called Astra) to use magical equivalents to modern day biological missiles.\n\nReferences[]\n\n↑ Fourth Databook, page 257\n\n↑ Naruto chapter 551, page 6"}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "", "Class": "Offensive, Supplementary", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Banshō Kokuin", "jutsu_description": "Madara creates a black sphere that attracts all matter to it and throws it forwards. As it goes, the sphere picks up debris, hitting any opponents on its path with it."}
{"Classification": "Kekkei Genkai, Hiden, Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Barrage of Gentle Fists", "jutsu_description": "The user delivers a series of quick blows of the Gentle Fist on the opponent."}
{"Classification": "Ninjutsu, Cooperation Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Barrier Shattering Technique", "jutsu_description": "If there is a barrier active, the user can see in enemy territory and shatter the barrier's source from within while his team lends him chakra. \n\nSee Also[]\nBarrier Releasing Technique"}
{"Classification": "Ninjutsu", "Nature": "Earth Release", "Class": "Offensive", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Assimilation: Sand Waterfall Funeral", "jutsu_description": "This technique is very similar to Gaara's Sand Waterfall Funeral, with the exception of using rock powder instead of sand. After capturing a target with the Assimilation: Sand Binding Coffin, Nagare causes the coffin to constrict and crushes the opponent to death."}
{"Classification": "Ninjutsu", "Nature": "Earth Release", "Class": "Offensive", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Assimilation: Sand Binding Coffin", "jutsu_description": "This technique is a copy of Gaara's Sand Binding Coffin by Nagare, with the difference being rock powder instead of sand. However, Nagare needs to use Assimilate All Creation Technique before he can use this technique. The powder encloses the opponent and then crushes them, killing them."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Asura Attack", "jutsu_description": "With the body modifications of the Asura Path, the user can open parts of their body to reveal a cannon that fires a massive blast of chakra with explosive power strong enough to devastate an entire area.[1] When Nagato used this through his path, he opened the body's head to reveal the chakra cannon, and when he did so himself after his reincarnation, he used an arm-mounted cannon."}
{"Classification": "Ninjutsu, Senjutsu", "Nature": "Fire ReleaseWind ReleaseLightning ReleaseEarth ReleaseWater ReleaseYin–Yang Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Ascension and Fall", "jutsu_description": "Obito slashes the opponent with the Sword of Nunoboko twice, throws a projectile from the Truth-Seeking Balls and morphs them into two large hands which ensnare the opponent with purple lightning-like chakra."}
{"Classification": "Kenjutsu, Fighting Style", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Assassination Technique", "jutsu_description": "A sword technique used by Root members. Using their signature double-edged, tip-less tantō, the user attacks their opponent with a series of swift slashes."}
{"Classification": "Kekkei Genkai, Ninjutsu", "Nature": "", "Class": "Offensive, Defensive, Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Attack of the Twin Demons", "jutsu_description": "This technique allows Ukon to inhabit his brother, Sakon's, body, moving within it freely and emerging from Sakon at will. This allows Ukon to help Sakon in combat in ways that Sakon would not be able to do alone, such as emerging from Sakon's back to intercept surprise attacks or producing hands from Sakon's head to attack from angles that Sakon cannot. Alternatively, Ukon can add his fists to Sakon's punches and feet to Sakon's kicks, tripling their power. Until opponents become aware of Ukon's presence, they are likely to be confused by Sakon's inexplicable and unpredictable combat ability.[1] Ukon can fully emerge from Sakon's body so that they can work together,[3] but because of how much time he spends in Sakon's body he isn't used to independent movement and thus tires easily.[4]\nAfter integrating Sakon's cells into his body, Kabuto Yakushi is able to use this technique to generate mindless clones of other shinobi, including the Sound Five and Orochimaru, from his own body in order to perform their techniques.[5]"}
{"Classification": "Hiden, Ninjutsu, Kenjutsu", "Nature": "Water Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Azure Stream", "jutsu_description": "Suigetsu creates a moving body of water beneath him that travels towards the opponent. He then slashes the opponent with the sword Kubikiribōchō multiple times.\n\nSee Also[]\nInstant Water\nWave Break\nWater Release: Surfing Strike"}
{"Classification": "Kekkei Genkai, Hiden, Ninjutsu", "Nature": "Explosion ReleaseEarth Release", "Class": "Offensive", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Art (jutsu)", "jutsu_description": "This article is about the jutsu from Naruto Shippūden: Ultimate Ninja 4. For the anime episode, see Art.\n\n\n\n\nDeidara creates a giant bird of clay, and then rides on top of it and flies rapidly towards the opponent, and releases several smaller birds of clay, who fly to the ground and trigger a series of explosions towards the opponent."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Armour-Eater", "jutsu_description": "The user melts pieces of their armour, creating a black liquid that they can freely manipulate. The material itself is durable enough that it isn't easily pierced and, in its liquid form, can be used to encase the target and trap their body.[1]\n\nSee Also[]\nSealing Technique: Octopus Hold\nReferences[]\n\n↑ Naruto Gaiden: The Road Illuminated by the Full Moon, page 25"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Armageddon Countdown Clock", "jutsu_description": "After performing the hand seal, a special clock appears on the palm of one's choosing. This clock was developed by Konohagakure, only to be used by the five Kage and their most trusted assistants. It serves as a countdown to the Earth's destruction, after Toneri dislodged the Moon from its orbit."}
{"Classification": "Hiden, Ninjutsu", "Nature": "", "Class": "Defensive", "Range": "Short range (0-5m)", "jutsu_name": "Armour of Sticky Gold", "jutsu_description": "Kidōmaru secretes Spider Sticky Gold from his pores like sweat until it fully covers his body. It solidifies instantly when it makes contact with the air, becoming a defensive armour as strong as steel.[1] Kidōmaru can produce the armour very quickly, even against attacks that take him by surprise.[2] As a special property of the Sticky Gold, the armour is fortified against chakra, granting Kidōmaru resistance to many ninjutsu and insulating him from attacks such as the Gentle Fist.[1]\n\nSee Also[]\nArmour of Sand\nReferences[]\n\n↑ 1.0 1.1 1.2 Tō no Sho, page 264\n\n↑ Naruto chapter 194"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive, Defensive", "Range": "Short range (0-5m)", "jutsu_name": "Arm of Shukaku", "jutsu_description": "Gaara engulfs himself in a sand barrier as Shukaku's arm bursts from an opening, striking the opponent.\n\nSee Also[]\nSand Binding Coffin"}
{"Classification": "Taijutsu", "Nature": "Earth Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Assimilation: Rock Tank", "jutsu_description": "This technique is a copied version of the Akimichi clan's Human Bullet Tank technique, the only difference being that the user uses the Assimilate All Creation Technique to fuse with a nearby rock and collect the necessary mass to perform it, instead of creating it themselves by converting body fat into chakra."}
{"Classification": "Ninjutsu", "Nature": "Earth Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Assimilation: Rock Blizzard", "jutsu_description": "After performing the Assimilate All Creation Technique to fuse with an object, Nagare controls the rocks that make up his \"body\" and pelts his opponent with the rocks able to regenerate immediately after any attack."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive, Defensive, Supplementary", "Range": "", "jutsu_name": "Assimilate All Creation Technique", "jutsu_description": "The Assimilate All Creation Technique enables the user to take on the properties of a nearby object, material, or substance, and any of its special characteristics. \n\nContents\n\n1 Overview\n2 Usage\n3"}
{"Classification": "Ninjutsu", "Nature": "Water Release", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Aqua Shoot", "jutsu_description": "The user gathers a small orb of water and kicks it towards the opponent.\n\nSee Also[]\nTruth-Seeking Kick"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "All ranges", "jutsu_name": "Area Scanning Technique", "jutsu_description": "By touching a solid surface with their hand or finger, the user can channel their chakra through the area, allowing them to accurately scan it. From this a person can roughly map out entire structures and surroundings, as well as determine the presence and location of targets in the surrounding area. Doing so allows to detect for threats, traps, and hidden rooms. It is also possible to determine the weak points and fine details in a single structure."}
{"Classification": "Ninjutsu, Kinjutsu", "Nature": "", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Antlion Ninja Arts: Ephemeral", "jutsu_description": "This article is about the anime-only kinjutsu used by Kagerō. For the genjutsu used by Itachi Uchiha, see Ephemeral. For other uses, see Utakata (disambiguation).\n\n\n\n\nThe user creates four firefly-like chakra wings and fires out a powerful energy blast from them. Kagerō claims that this technique can be used only once in a lifetime since it consumes so much chakra that the user is left in a near-death state after performing it. During the duration of this technique, the user can also transport themselves instantaneously using a technique that is similar to teleportation.\n\nSee Also[]\nEight Gates\nPressure Points of Harm and Death\nSeven Heavens Breathing Method\nBando's Chakra Armour\nReferences[]\n\n↑ Naruto Collectible Card Game"}
{"Classification": "Taijutsu, Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Apricot Blossom Droop", "jutsu_description": "Kurenai attacks her opponent with a combination of an elbow blow and two kicks before releasing a breath of cherry blossom petals that burst at the opponent, bombarding them."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Arm Growth Technique", "jutsu_description": "From the shoulders, the user is able to create an extra set of muscular arms of varying size. From these arms, the user can shield himself from ninjutsu, form hand seals, and even provide extra mobility to move about and scale terrains."}
{"Classification": "Taijutsu, Fighting Style", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Arhat Fist", "jutsu_description": "This fighting style relies on Jirōbō's brute strength to carry out showy and violent physical attacks. By taking careful control of his weight and making complicated body movements, Jirōbō is able to use his entire body to break and crush targets. Jirōbō's naturally \"monstrous\" strength is drastically increased when he activates his cursed seal, to the point that, in its second level, he is able to throw Chōji Akimichi's Super Multi-Size Technique.[1]\n\nMoves[]\n\n\n\n\nRising Knee (昇膝, Shōshitsu, English TV: Crushing Knee): Jirōbō strikes his opponent with an upward thrust of his knee.[2]\n\n\n\n\nThrusting Shoulder (突肩, Tokken, English TV: Shoulder Charge): Jirōbō strikes his opponent with his shoulder.[2]\n\n\n\n\nCrumbling Palm (崩掌, Hōshō, English TV: Shatter Palm): Jirōbō strikes his opponent with a forward palm thrust.[3]\n\n\n\n\nRising Attack Palm (昇撃掌, Shōgekishō, English TV: Slamming Palm): Jirōbō strikes his opponent with an upwards palm thrust.[4]\n\n\n\n\nPressure Palm (圧掌, Asshō, English TV: Crushing Palm): Jirōbō strikes his opponent with a downwards palm thrust.[4]\n\n\n\n\nRock Attack (岩撃, Gangeki, English TV: Slamming Boulder): Jirōbō punches his opponent.[4]"}
{"Classification": "Ninjutsu, Hiden", "Nature": "Earth Release", "Class": "Supplementary", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Ankorodō Hiden Ninjutsu: Mochi Release: Infinite Dumplings", "jutsu_description": "The user causes the dumplings near them to grow to enormous sizes. The constant growth makes it difficult for attacks to subdue the growing substance. Consumed dumplings will no longer grow."}
{"Classification": "Kekkei Genkai, Ninjutsu, Space–Time Ninjutsu, Dōjutsu, Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Annihilation", "jutsu_description": "Obito lands a series of punches and kicks to his opponent, all the while phasing between attacks."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "", "Class": "Offensive, Defensive, Supplementary", "Range": "", "jutsu_name": "Animal Path", "jutsu_description": "This article is about the ability.  For other uses, see Animal Path (disambiguation).\n\n\n\n\nThe Animal Path (畜生道, Chikushōdō) grants a Rinnegan user the ability of summoning various animals and creatures to aid it in battle. These creatures appear to be immortal, as they were killed and later summoned again. Worthy of note, summoning creatures through the Animal Path require no blood sacrifice or hand seals. The Animal Path can also summon people using hand signs, such as the case of Nagato's Paths and Konan. Tactics-wise, the Animal Path's primary role in battle appears to consist of overwhelming multiple opponents with a barrage of summons.\nIn the case of Nagato, having originally channelled the Animal Path through the corpse of a Fūma clan shinobi and then the corpse of Ajisai in life, the creatures summoned appear to have undergone the same modifications as his Paths of Pain, having chakra receivers embedded in their bodies. Nagato also tends to send the Animal Path first into battle to throw enemies off about the number of enemies they are really facing. As they also display the Rinnegan, the creatures serve as extensions of Nagato.[1] During the Fourth Shinobi World War, Nagato used his summons for transport before being rejuvenated to move on his own power. \n\nSummons\n\nGiant Drill-Beaked Bird\nGiant Multi-Headed Dog\nGiant Snake-Tailed Chameleon\nGiant Panda\nGiant Ox\nGiant Rhino\nGiant Crustacean\nGiant Centipede\nThe other Paths of Pain\nKonan\nInfluences[]\nBuddhists believe that animals inhabit a different dimension separated from humans not spatially but mentally, called the \"Tiryagyoni realm\"; an unhappy plane of rebirth which revolves around fear, instinct and survival of the fittest, suffered by those animals that work for humans and, above all, by those ignorant to what is happening to them.\n\nReferences[]\n\n↑ Naruto chapter 551, page 6"}
{"Classification": "Kinjutsu, Juinjutsu, Senjutsu", "Nature": "", "Class": "Supplementary", "Range": "", "jutsu_name": "Animal Cursed Seal", "jutsu_description": "This is a unique cursed seal applied by Orochimaru, still in its experimental stages, and therefore was incomplete and unstable.\n\nContents\n\n1 Overview\n\n1.1 Acquisition\n\n1.1.1 Ingredients\n\n\n1.2 Appearance\n1.3 Powers\n\n\n2 Drawbacks\n3"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Defensive", "Range": "Short range (0-5m)", "jutsu_name": "Armour of Sand", "jutsu_description": "This technique is the second part of Gaara's \"Absolute Defence\", his Shield of Sand being the first part. As the name implies, Gaara covers his body in a layer of sand, wearing it like armour. Although it defends him from attacks that bypass his Shield of Sand, maintaining it consumes a great deal of chakra. Furthermore, it does not activate automatically like the Shield of Sand does (instead relying on Gaara to apply when needed), nor is it as resilient;[1] wherever part of the Armour of Sand is struck, that section of it crumbles away. The sand itself also weighs Gaara down, slowing him and placing greater strain on his movements. Despite all this, the Armour of Sand's combination with the Shield of Sand is an effective one, enabling Gaara to go years without the slightest injury.[2]\n\nSee Also[]\nArmour of Sticky Gold\nCrystal Armour\nEarth Release: Hardening Technique\nEarth Release: Earth Spear\nLava Release Chakra Mode\nLightning Release Chakra Mode\nRock Armour\nSand Cloak Technique\nReferences[]\n\n↑ 1.0 1.1 Rin no Sho, page 203\n\n↑ Naruto chapter 83"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Long range (10m+)", "jutsu_name": "Amenosubaruboshinomikoto: Ryūgū", "jutsu_description": "The user extends their arm outward at the target with an open palm. A massive purple ball of energy is then unleashed, followed by a immense demonic purple serpent. Its power is able to compete with the Parent and Child Rasengan."}
{"Classification": "Bukijutsu, Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Amputation Punishment", "jutsu_description": "Hidan attacks the enemy many times with his scythe, then he flips in the air while cutting downwards onto the opponent."}
{"Classification": "Kekkei Genkai, Ninjutsu, Space–Time Ninjutsu, Dōjutsu", "Nature": "", "Class": "Supplementary", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Amenotejikara", "jutsu_description": "Amenotejikara is a space–time ninjutsu used by Sasuke Uchiha through the power of his Rinnegan, which was entrusted to him by the Sage of Six Paths.[1]\n\nContents\n\n1 Usage\n2 Influence\n3"}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu, Kenjutsu, Space-Time Ninjutsu", "Nature": "Lightning Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Amenotejikara: Instant", "jutsu_description": "Sasuke attacks his opponent with sword slashes and kicks, uses Banshō Ten'in to pull them closer and stun them with Chidori Sharp Spear, before jumping up and throwing a kunai behind his opponent, which he switches with, and slashes them with an electrified slash from his sword."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu, Shurikenjutsu", "Nature": "Fire ReleaseLightning Release", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Amenotejikara: Chidori", "jutsu_description": "Sasuke throws some lightning infused kunai at his opponent. When they're about to connect, Sasuke switches place with one of them, and delivers a Kagutsuchi enhanced Chidori."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Anātman", "jutsu_description": "Gaara sends a wave of sand towards his opponent, holding them in the air, then throwing them into the ground, and finally up in the air again."}
{"Classification": "Ninjutsu, Space–Time Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "Amplification Summoning Technique", "jutsu_description": "This is a summoning technique that bestows a special ability upon a summoned creature once predefined condition has been met.[1]\n\nOverview[]\nWhile it is unknown how often Pain modified any of his other summoned creatures with this technique, he has granted his dog summon a number of abilities that increased both its offensive potential and overall resilience.[1] For instance, having set the condition to multiply when being dealt damage, the canine could divide into more identical beasts and increase its combat capability. It seems that multiple abilities can be granted, as the beasts can recombine if needed, having one body carry the heads of however many additional beasts were created. It was also given the ability to split independent of damage, grow wings that enable flight, shape-shift to avoid capture, as well as the ability to self-destruct.[2]\n\nSee Also[]\nSlug Great Division\nReferences[]\n\n↑ 1.0 1.1 1.2 Sha no Sho, page 282\n\n↑ Naruto: Shippūden episode 131"}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Amenosubaruboshinomikoto: Gyokkō", "jutsu_description": "The user extends their arm outward at the target with an open palm. A purple energy burst in then unleashed in a variety of ways, including a powerful shockwave or a ball of great concussive force."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu, Kenjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Ame no Ohabari", "jutsu_description": "Utlising his Susanoo, Itachi performs a horizontal slash with the Sword of Totsuka."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive, Supplementary", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Amenosubaruboshinomikoto", "jutsu_description": "Using his chakra-made fishing rod, Urashiki launches a barrage of multiple hooks at his opponent to steal their chakra."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Amenomihashira", "jutsu_description": "After cupping both hands, the user creates a barrier with a large spiralling sphere of chakra inside. The sphere will then split into five smaller versions. After which the user can launch the attack. If the attack collides with another attack, the barrier will take the damage, releasing the five spheres so the attack can continue its path. Upon contact, the spheres will disperse in a fairly large explosion.\n\nContents\n\n1 Influence\n2"}
{"Classification": "Kekkei Mōra, Ninjutsu, Space–Time Ninjutsu, Dōjutsu", "Nature": "", "Class": "Supplementary", "Range": "All ranges", "jutsu_name": "Amenominaka", "jutsu_description": "Using her Rinne Sharingan, Kaguya Ōtsutsuki replaces the world around her with one of her personal dimensions; everyone near Kaguya at the time will experience the same change of place.[1] Unlike most space–time ninjutsu, where users move themselves to a destination, Kaguya moves the destination to herself.[2] To relocate such large dimensions requires an immense amount of chakra, so much so that only Kaguya is able to do so.[1] However, even she will start to tire out if she uses Amenominaka too much.[3] To an onlooker, Kaguya and everyone else will appear to simply vanish from the previous dimension they were in, without even a detectable trace of their chakra left behind.[4]\nThose affected by Amenominaka will maintain their positions relative to each other between dimensions, so that somebody approaching Kaguya in one dimension will still be approaching her in the next. Because Amenominaka works on everybody in the vicinity of Kaguya, she cannot use it to escape from attackers or to transport only certain individuals to other dimensions; for both purposes, she instead relies on Yomotsu Hirasaka.[5] Kaguya does seem to have some control over where she and the others will appear within a dimension, giving her a strategic option: when first depicted, she shifts high into the air of her lava dimension, leaving her opponents to fall into the molten sea below;[2] when she is being attacked by Naruto Uzumaki and Sasuke Uchiha, she shifts to a part of her ice dimension that places Naruto and Sasuke within a glacier, trapping them and thus stopping their attack.[5]\nWhen Kakashi Hatake first experiences Amenominaka, he believes it is the result of a genjutsu because of how suddenly it happens and how stark the change is from where he was (Earth). It is only from noticing that the new world is too vast in size and intricate in detail that he realises it cannot be a mere illusion.[2] He nevertheless revisits the genjutsu comparison later, noting that - from his perspective - Kaguya seems to be instantly rewriting reality with each use of Amenominaka.[5]"}
{"Classification": "Kekkei Genkai, Dōjutsu, Ninjutsu", "Nature": "Fire Release", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Amaterasu: Wailing Sky", "jutsu_description": "Using Susanoo, Indra sends Amaterasu to the sky, which then rains down on the opponent."}
{"Classification": "Taijutsu", "Nature": "", "Class": "Offensive, Defensive", "Range": "Short range (0-5m)", "jutsu_name": "Anger of the Sky and the Cherry Blossom and the Earth", "jutsu_description": "Sakura summons a giant Inner Sakura to strike the ground with her fist, causing a massive shock wave to be sent on both sides."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "Fire Release", "Class": "Offensive, Supplementary", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Amaterasu: Lingering Fire", "jutsu_description": "Sasuke has his Susanoo extend its hand holding a giant Amaterasu orb, and causes it to release smaller Amaterasu orbs, which explode on when it comes into contact with the opponent. The orbs remain as traps on the battlefield for a short while."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Amanohabaya", "jutsu_description": "Kinshiki manifests several different bladed weapons and hurls them at his opponent."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive, Supplementary", "Range": "", "jutsu_name": "Altering Terrain Technique", "jutsu_description": "Using her diagram scroll, Fuen maps out an area and then is able to physically modify it to her will by drawing in additions to the terrain."}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "Fire Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Amaterasu", "jutsu_description": "This article is about the ninjutsu Amaterasu. For the Naruto: Shippūden episode, see Amaterasu!.\n\n\n\nAmaterasu is a Mangekyō Sharingan dōjutsu, and the highest level of Fire Release.[2] Said to represent the \"Material World and Light\" (物質界と光, Busshitsukai to Hikari), Amaterasu is the antipode to Tsukuyomi.[1]\n\nContents\n\n1 Overview\n2 Influence\n3"}
{"Classification": "Kekkei Genkai, Ninjutsu, Dōjutsu", "Nature": "Fire Release", "Class": "Defensive", "Range": "Short range (0-5m)", "jutsu_name": "Amaterasu: Flame Wrapping Fire", "jutsu_description": "The manipulated flames of Amaterasu are used to cover the ribs of Susanoo with the flames, surrounding the user with a shield of black fire. In addition to the damage it can inflict, this technique has the psychological effect of causing melee enemies to hesitate in attacking the user of this technique."}
{"Classification": "Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Almighty Sakura", "jutsu_description": "Sakura gathers large quantities of chakra and summons her Inner Sakura, and releases a painful punch onto the enemy.\n\nSee Also[]\nCherry Blossom Impact"}
{"Classification": "Kekkei Genkai, Cooperation Ninjutsu, Ninjutsu, Dōjutsu", "Nature": "Fire Release", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "Amaterasu: Dual Layer", "jutsu_description": "Sasuke and Itachi simultaneously use Amaterasu on the opponent, pushing them back, and then each summons their Susanoo, before shooting an arrow and a group of Yasaka Magatama, respectively. The impact results in an explosion of the black flames, after which they apply a second layer of Amaterasu, compressing the explosion for a moment before it builds up and explodes again."}
{"Classification": "Kekkei Mōra, Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "All ranges", "jutsu_name": "All-Killing Ash Bones", "jutsu_description": "A certain-kill technique, the user hardens their own bones and protrudes them out of the skin, and then fires these weaponised structures from their back or from their palms at the intended target. When these bones pierce a living organism, the bone and target starts to deteriorate at a molecular level, disintegrating the victim and reducing their bodies to nothing more than a pile of ash.\nKaguya has used this attack in a variety of ways: as a projectile attack, incorporating the use of her dimension-manifesting abilities to land a two-sided attack as well as a close-range melee attack.[2]\nUnlike other certain-kill techniques, in which the victim can survive if they possess extraordinary endurance, this technique is guaranteed to kill the victim if it connects and thus, truly lives up to the name of certain-kill techniques."}
{"Classification": "Kekkei Genkai, Hiden, Ninjutsu, Genjutsu, Taijutsu, Cooperation Ninjutsu", "Nature": "Storm ReleaseLava ReleaseLightning ReleaseWind ReleaseEarth ReleaseWater ReleaseFire ReleaseYin Release", "Class": "Offensive, Defensive, Supplementary", "Range": "All ranges", "jutsu_name": "Allied Shinobi Forces Technique", "jutsu_description": "This article is about collaborative techniques used by the Allied Shinobi Force.  For other uses, see Allied Shinobi Forces Technique (disambiguation).\n\n\n\n\nThe Allied Shinobi Forces Technique is a combination of many techniques devised by Shikaku Nara, using the unique abilities of the Allied Shinobi Forces to combat the Ten-Tails.\n\nUsage[]\nThe Allied Shinobi Forces Technique is focused on three primary goals; disrupt the opponents sensory abilities, restrain the Ten-Tails, and combat and remove Madara and Obito Uchiha from play. Using Inoichi's telepathic abilities, Shikaku was able to relay the formation to every member of the alliance at once.\nThe first step would executed by the Kumo-nin, who would use Lightning Release: Lightning Illusion Flash of Lightning Pillar to temporarily blind the opponents and Storm Release: Laser Circus to create a cloud of dust. Next, Suna-nin would use their Wind Release: Air Current Wild Dance to manipulate the dust to further obscure the Uchiha's vision, while Aburame clan members and Kiri-nin would use their Insect Jamming Technique and Hiding in Mist Technique to impair their sensory skills. \nThe second step, to restrain the Ten-Tails, would see the Iwa-nin create a large sink hole with their Earth Release: Great Moving Earth Core, with their lava users covering the beast with quicklime, mixing it with the Kiri-nin's water. Konoha's Sarutobi clan would then heat this mixture into concrete, trapping the Ten-Tails.\nWith the Ten-Tails restrained, the rest of the alliance would rush Madara and Obito using taijutsu, having coordinated with Naruto to exploit their weaknesses."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Supplementary", "Range": "Short range (0-5m)", "jutsu_name": "All Weapons Above Heaven", "jutsu_description": "This technique raises all the status boosts (Speed, Attack, Defence) for all characters in battle with Tenten."}
{"Classification": "Kekkei Genkai, Ninjutsu", "Nature": "Wood ReleaseFire ReleaseEarth ReleaseWater ReleaseLightning ReleaseWind Release", "Class": "Offensive", "Range": "Mid to Long range (5m+)", "jutsu_name": "All is Suffering", "jutsu_description": "Using the giant statue as a medium, each of the five smaller heads encircling the statue's main head simultaneously release a stream of a different elemental nature attack.\n\nInfluence[]\nIssai Kaiku (一切皆苦) is a Japanese four-character idiom for the first of the Four Noble Truths in Buddhist teaching, the Dukkha, specifically that all experiences are ultimately sources of suffering."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Defensive", "Range": "Mid to Long range (5m+)", "jutsu_name": "Air Sand Protective Wall", "jutsu_description": "This air defence technique creates a giant shield of sand that is suspended in mid-air by raising a great amount of sand from the ground. By gathering the best possible mineral-rich sand, the hardness of the shield is considered to be very high. \nFurthermore, the sand has its defensive strength raised by flowing chakra through it. It was strong enough to protect Sunagakure from Deidara's C3, and stop a lightened Tengai Shinsei.\nIn the The Last: Naruto the Movie, Gaara uses this technique in conjunction with wind-natured chakra, creating multiple giant sand shields, to protect his village from a falling meteor."}
{"Classification": "Ninjutsu, Shurikenjutsu, Clone Techniques, Kinjutsu", "Nature": "", "Class": "Offensive", "Range": "Short to Mid range (0-10m)", "jutsu_name": "All Directions Shuriken", "jutsu_description": "After using the Multiple Shadow Clone Technique, Naruto Uzumaki and his shadow clones simultaneously throw shuriken at a target. Because of how many shuriken there are and how many directions they're thrown from, the target, regardless of how skilled they may be, cannot reasonably dodge all of them.[1] As such, their only real option is to try and shield themselves to minimise the damage.[2] This focus on the shuriken inevitably creates blind-spots in the target, which is the actual purpose of this technique: the many Narutos can focus on these blind-spots to execute additional attacks.[1]"}
{"Classification": "Kekkei Genkai, Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Alder", "jutsu_description": "Kimimaro rushes at his opponent, and using them as support, jumps over them, and grows bone spikes from his back, hitting them at once."}
{"Classification": "Ninjutsu, Kinjutsu", "Nature": "Earth Release", "Class": "Supplementary", "Range": "", "jutsu_name": "Akuta", "jutsu_description": "Akuta is an Earth Release technique that's created from a Land of Earth's kinjutsu, which is seemingly inspired by a jutsu that was unearthed by Ōnoki. It was a technique designed by Ōnoki to protect the village from attackers while lowering the number of casualties.\n\nOverview[]\nThe Akuta creates living organisms made of clay[1] that are weaponised. They are able to phase through the earthen ground for travel and drag their enemies with them, as well as extend their limbs.[2] While they have no fear, they have a limited lifespan and intelligence, being capable of obeying instructions and communicating with fabrications.[3] Their masks are their weakness, the destruction of which would lead to their deaths.\nWhile deemed to have no will, this was prove false in Akkun's existence, a small Akuta who gained affection to Inojin Yamanaka, and even defied its comrades to protect him. Kirara deemed Akkun as a defect for such traits. When the fabrications decided to take matters into their own hands, the Akuta produced even went against Ōnoki's orders.\n\nDevelopment[]\nŌnoki created this technique in response to a missing-nin's attack claiming the lives of many young shinobi. When he first demonstrated it, they suddenly disobeyed him and attempted to attack the audience, which led Kurotsuchi to reject the technique's further development. Despite this, Ōnoki continued to hone this technique in secrecy, eventually managing to create more obedient creatures.\nIwagakure housed an underground facility where more Akuta are being mass produced. It was later destroyed by Konohamaru Sarutobi.\n\nReferences[]\n\n↑ Boruto episode 88\n\n↑ Boruto episode 82\n\n↑ Boruto episode 89"}
{"Classification": "Kekkei Genkai, Ninjutsu, Taijutsu", "Nature": "Wood Release", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Adamantine Power: Acala", "jutsu_description": "Hashirama kicks the opponent away and raises some wood tendrils to strike the enemy down. With the opponent layed on the ground, Hashirama gathers a large amount of chakra into his right fist, jumps and drives it into his foe's torso. The impact causes the ground to break apart and a small forest to erupt from it."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Defensive", "Range": "", "jutsu_name": "Absorption Sphere", "jutsu_description": "Using the Jutsu Absorption Arm, the user creates a sphere after a short moment, which can absorb multiple ninjutsu attacks simultaneously, leading to it growing in size. As the sphere itself is ninjutsu, another sphere can cancel it out."}
{"Classification": "Taijutsu, Collaboration Techniques", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Absolute: Fang Passing Fang", "jutsu_description": "Kiba and Akamaru perform the Fang Passing Fang to send the opponent flying into the air, then they increase their spinning power to finish the opponent off by catching them in between their attack."}
{"Classification": "Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "1000 Metre Punch", "jutsu_description": "The user focuses a large amount of chakra into their fist and punches the opponent, sending them at least one kilometre (1000 metres) away."}
{"Classification": "Ninjutsu", "Nature": "Water Release", "Class": "Offensive", "Range": "", "jutsu_name": "Acid Permeation", "jutsu_description": "Utakata blows acidic bubbles from his pipe that burn anything it comes into contact with. The sheer multitude and wide-range it can cover makes avoiding it very difficult."}
{"Classification": "Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Long range (10m+)", "jutsu_name": "Acidic Sludge", "jutsu_description": "The user spits out a small purple liquid at the target, which evaporates in acidic fashion, when in contact with the target. It is shown to be powerful enough to incapacitate Kushina Uzumaki, even though she was only hit with a small part of the liquid on her leg."}
{"Classification": "Kekkei Genkai, Hiden, Ninjutsu, Fūinjutsu, Taijutsu, Kinjutsu, Cooperation Ninjutsu", "Nature": "", "Class": "Offensive", "Range": "Short to Mid range (0-10m)", "jutsu_name": "Accelerated Armed Revolving Heaven", "jutsu_description": "Tenten unseals several weapons from her scrolls, which Lee and Neji send at their opponent with a kick and a vacuum palm. Lee and Neji leap into the air, where Lee accelerates the rotation of Neji's Eight Trigrams Palms Revolving Heaven using the Front Lotus. Tenten then throws a kunai-filled string around them, adding to the combination's power. The impact results in an explosion."}
{"Classification": "Taijutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "16 Hit Combo", "jutsu_description": "A very effective move, Ino uses this as a quick knock-out move on a opponent. She slaps and kicks with flower petals trailing from her hands and feet around her body."}
{"Classification": "Taijutsu, Kenjutsu", "Nature": "", "Class": "Offensive", "Range": "Short range (0-5m)", "jutsu_name": "Acrobat", "jutsu_description": "The Acrobat (荒繰鷺伐刀, Akurobatto) is a kenjutsu used by Killer B in tandem with his swords and the standard technique of his unique Disturbance Taijutsu fighting style.\n\nUsage[]\nWhen in battle, B holds his swords in a peculiar and unique manner. More often than employing his hands, B would wield his blades in and between various parts of his body. The first two are held in the hinge joint of his right and left arm, another between his shoulder blade and neck, one in his mouth, under his left armpit, another between the hip joint of his right, raised leg and the back leg of the same raised leg. As strange as it seems, Killer B is extremely skilled with these blades and this fighting style which he began adopting since a young age.[3] The most dangerous aspect of this style is the unpredictability of his movements, easily catching his opponents by surprise. He can spin in a manner similar to a buzz-saw, or else employing a series of unrelenting attacks switching the locations as well as the blades with which he attacks, leaving no openings for even a skilled Sharingan user like Sasuke Uchiha,[4] and a highly trained swordsman like Suigetsu Hōzuki, who remarked that the method of attack was completely unpredictable.[5] Killer B was also able to throw these swords from their normally awkward positions, either to hit his opponents from range, or to impale his opponent at close range and cause damage that would normally be lethal.[6]\nThe swords can be charged with lightning chakra to greatly increase their cutting power through high-frequency vibrations.[7] Because of the streamline shape of these swords, they serve as fairly good projectiles as well.[8] In the anime Killer B was able to use the Eight-Tails' tentacle to extend his reach for a surprise attack.[9]"}
